DataProcessors/упРМУправлениеРемонтами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>упРМУправлениеРемонтами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/упСпособыРемонтов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыРемонтов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СторонняяОрганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнымиСилами</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСпособыПланированияРемонтныхРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСпособыПланированияРемонтныхРабот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументомЗаявкаНаРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументомРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоВыбору</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСтатусыЗаявкиНаРемонтИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыЗаявкиНаРемонтИТОТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СформированРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРемонте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упСтатусыРемонтаИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыРемонтаИТОТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Начат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упЗаявкаНаРемонтИТОТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упЗаявкаНаРемонтИТОТС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.упПлановоеРасписаниеРаботыГаража</xr:Item>
				<xr:Item>InformationRegister.упСтатусыЗаявокНаРемонтИТОТС</xr:Item>
				<xr:Item>InformationRegister.упЗанятостьТранспорта</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>InformationRegister.упПлановыеДатыТО</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агрегат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упШиныУзлыИАгрегаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гараж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОборудованиеРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентСервиснойОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМестаРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упНаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРемонтаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упОбъектыРемонта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРемонтаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРаспределенияЗатратОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОбращения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервиснаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПрочиеСоглашения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРемонта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСпособыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыПлан</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРасходыПланНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредствоОбъектаРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаРасходыПланНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаРасходыПланВалюта</Name>
					<Comment>Плановая стоимость работ в валюте регл. учета</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСуммаРасходыПланНДСВалюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоОпераций</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаПоРемонту</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упРаботыПоРемонту</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.упСтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РемонтируемоеДополнительноеОборудование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДополнительноеОборудование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упДополнительноеОборудование</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРемонта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыРемонтов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/упГаражи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упГаражи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упАдреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьРасписаниеРаботыГаража</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОМоточасы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПредупрежденияОТОПробег</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Пробег</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/упРМУправлениеРемонтами/Forms/ПакетнаяОбработкаРемонтовИТОТС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Гараж                 = Параметры.Гараж;
	ТекущаяДата           = Параметры.ТекущаяДата;
	ДатаНачальныхОстатков = Параметры.ДатаНачальныхОстатков;
	СрокОтсчета           = Параметры.СрокОтсчета;
	СрокПредупрежденияОТОПробег      = Параметры.СрокПредупрежденияОТОПробег;
	СрокПредупрежденияОТОМоточасы    = Параметры.СрокПредупрежденияОТОМоточасы;
	СпособПланированияРемонтныхРабот = Параметры.СпособПланированияРемонтныхРабот;
	АдресСхемыКомпоновкиДанных       = Параметры.АдресСхемыКомпоновкиДанных;
	НастройкиСхемыКомпоновкиДанных   = Параметры.НастройкиСхемыКомпоновкиДанных;	
	СпособРемонта = Перечисления.упСпособыРемонтов.СобственнымиСилами;
	ИнициализироватьКомпоновщикНастроек(НастройкиСхемыКомпоновкиДанных);
	
	// СтандартныеПодсистемы.Печать
	мсвСписокОбъектов = Новый Массив;
	мсвСписокОбъектов.Добавить(Метаданные.Документы.упРемонтИТОТС);
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект, Элементы.СписокРемонтовДляПечати.КоманднаяПанель, мсвСписокОбъектов);
	// Конец СтандартныеПодсистемы.Печать
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СписокСозданныхЗаявокНаРемонтВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если Поле.Имя = "СписокСозданныхЗаявокНаРемонтОбъектРемонта" Тогда
			Если ТипЗнч(ТекущиеДанные.ОбъектРемонта) = Тип("СправочникСсылка.упТранспортныеСредства") Тогда
				ОткрытьФорму("Справочник.упТранспортныеСредства.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ОбъектРемонта), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе	
				ОткрытьФорму("Справочник.упДополнительноеОборудование.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ОбъектРемонта), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		ИначеЕсли Поле.Имя = "СписокСозданныхЗаявокНаРемонтЗаявкаНаРемонтИТОТС" Тогда
			ОткрытьФорму("Документ.упЗаявкаНаРемонтИТОТС.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ЗаявкаНаРемонтИТОТС), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокСозданныхРемонтовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Если Поле.Имя = "СписокСозданныхРемонтовОбъектРемонта" Тогда
			Если ТипЗнч(ТекущиеДанные.ОбъектРемонта) = Тип("СправочникСсылка.упТранспортныеСредства") Тогда
				ОткрытьФорму("Справочник.упТранспортныеСредства.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ОбъектРемонта), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Иначе	
				ОткрытьФорму("Справочник.упДополнительноеОборудование.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.ОбъектРемонта), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		ИначеЕсли Поле.Имя = "СписокСозданныхРемонтовРемонтИТОТС" Тогда
			ОткрытьФорму("Документ.упРемонтИТОТС.ФормаОбъекта", Новый Структура("Ключ", ТекущиеДанные.РемонтИТОТС), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОтборПодобратьОбъектыРемонта(Команда)
	ПерейтиНаСтраницу(Элементы.СписокОбъектов);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовОтметитьВсе(Команда)
	
	Для каждого Строка Из СписокОбъектовРемонта Цикл
		Строка.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовСнятьВсе(Команда)
	Для каждого Строка Из СписокОбъектовРемонта Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовФормированиеРемонтов(Команда)
	ФормируютсяДокументыРемонт = Истина;
	СформироватьРемонтыНаСервере();
	ПерейтиНаСтраницу(Элементы.Ремонты);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовФормированиеЗаявокНаРемонт(Команда)
	ФормируютсяДокументыРемонт = Ложь;
	СформироватьЗаявкиНаРемонтНаСервере();
	ПерейтиНаСтраницу(Элементы.Ремонты);	
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовНазад(Команда)
	ПерейтиНаСтраницу("ОтборОбъектыРемонта");
КонецПроцедуры

&НаКлиенте
Процедура СписокОбъектовПечатьДокументов(Команда)
	ПерейтиНаСтраницу(Элементы.ПечатьДокументов);
КонецПроцедуры

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	ОписаниеКоманды = УправлениеПечатьюКлиентПовтИсп.ОписаниеКомандыПечати(Команда.Имя, ЭтаФорма.Команды.Найти("АдресКомандПечатиВоВременномХранилище").Действие);
	
	мсвДокументов = Новый Массив;
	мсвСтрокиСписка = СписокРемонтовДляПечати.НайтиСтроки(Новый Структура("Пометка",Истина));
	
	Для каждого Строка Из мсвСтрокиСписка Цикл
		мсвДокументов.Добавить(Строка.РемонтИТОТС);
	КонецЦикла;

	ОписаниеКоманды.СразуНаПринтер = НапечататьСразуНаПринтер;
	ОписаниеКоманды.Вставить("ОбъектыПечати", мсвДокументов);
	Если НапечататьСразуНаПринтер Тогда
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(ОписаниеКоманды.МенеджерПечати, ОписаниеКоманды.Идентификатор,
		ОписаниеКоманды.ОбъектыПечати, ОписаниеКоманды.ДополнительныеПараметры);
	Иначе
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(ОписаниеКоманды.МенеджерПечати, ОписаниеКоманды.Идентификатор,
		ОписаниеКоманды.ОбъектыПечати, ЭтаФорма, ОписаниеКоманды);
	КонецЕсли;

	
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать

&НаКлиенте
Процедура РемонтыЗаявкиСнятьВсе(Команда)
	Для каждого Строка Из СписокСозданныхЗаявокНаРемонт Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыЗаявкиОтметитьВсе(Команда)
	Для каждого Строка Из СписокСозданныхЗаявокНаРемонт Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыРемонтыОтметитьВсе(Команда)
	Для каждого Строка Из СписокСозданныхРемонтов Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыРемонтыСнятьВсе(Команда)
	Для каждого Строка Из СписокСозданныхРемонтов Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РемонтыПечатьДокументов(Команда)
	ПерейтиНаСтраницу(Элементы.ПечатьДокументов);
КонецПроцедуры

&НаКлиенте
Процедура РемонтыНазад(Команда)
	ПерейтиНаСтраницу(ПредыдущаяСтраницаСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокументовНазад(Команда)
	ПерейтиНаСтраницу(ПредыдущаяСтраницаСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокументовОтметитьВсе(Команда)
	Для каждого Строка Из СписокРемонтовДляПечати Цикл
		Строка.Пометка = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДокументовСнятьВсе(Команда)
	Для каждого Строка Из СписокРемонтовДляПечати Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаКлиенте
Процедура УстановитьВидимостьКомандПанелиНавигации()
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ОтборОбъектыРемонта Тогда
		Элементы.НавигацияСтраницы.ТекущаяСтраница     = Элементы.НавигацияОтборОбъектыРемонта;
		Элементы.ОтборПодобратьОбъектыРемонта.КнопкаПоУмолчанию = Истина;
		ЗаголовокСтраницы	= Нстр("ru = 'Настройка отбора объектов ремонта'");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СписокОбъектов Тогда
		Элементы.НавигацияСтраницы.ТекущаяСтраница = Элементы.НавигацияСписокОбъектовРемонта;
		//Элементы.СписокТСФормированиеПутевыхЛистов.КнопкаПоУмолчанию = Истина;
		ЗаголовокСтраницы	= Нстр("ru = 'Список объектов ремонта'");
		
		Если СпособПланированияРемонтныхРабот = ПредопределенноеЗначение("Перечисление.упСпособыПланированияРемонтныхРабот.ПоВыбору") Тогда
			Элементы.СписокОбъектовФормированиеРемонтов.КнопкаПоУмолчанию = Истина;
			
		ИначеЕсли СпособПланированияРемонтныхРабот = ПредопределенноеЗначение("Перечисление.упСпособыПланированияРемонтныхРабот.ДокументомЗаявкаНаРемонт") Тогда	
			Элементы.СписокОбъектовФормированиеЗаявок.КнопкаПоУмолчанию = Истина;
			Элементы.СписокОбъектовФормированиеРемонтов.Видимость = Ложь;
						
		ИначеЕсли СпособПланированияРемонтныхРабот = ПредопределенноеЗначение("Перечисление.упСпособыПланированияРемонтныхРабот.ДокументомРемонт") Тогда		
			Элементы.СписокОбъектовФормированиеРемонтов.КнопкаПоУмолчанию = Истина;
			Элементы.СписокОбъектовФормированиеЗаявок.Видимость = Ложь;
			
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Ремонты Тогда
		Элементы.НавигацияСтраницы.ТекущаяСтраница = Элементы.НавигацияРемонты;
		//Элементы.ПутевыеЛистыПечатьДокументов.КнопкаПоУмолчанию = Истина;
				
		Если ФормируютсяДокументыРемонт Тогда
			ЗаголовокСтраницы	= Нстр("ru = 'Формирование ремонтов'");
		Иначе
			Элементы.РемонтыПечатьДокументов.Видимость = Ложь;
			ЗаголовокСтраницы	= Нстр("ru = 'Формирование заявок'");
		КонецЕсли;
	
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ПечатьДокументов Тогда	
		Элементы.НавигацияСтраницы.ТекущаяСтраница = Элементы.НавигацияПечатьДокументов;
		Элементы.ПечатьДокументовЗакрыть.КнопкаПоУмолчанию = Истина;
		ЗаголовокСтраницы	= Нстр("ru = 'Печать ремонтов'");
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНаСтраницу(ЭлементСтраница)
	
	ПредыдущаяСтраница = Элементы.Страницы.ТекущаяСтраница;
	
	Если ТипЗнч(ЭлементСтраница) = Тип("Строка") Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы[ЭлементСтраница];
	Иначе	
		Элементы.Страницы.ТекущаяСтраница = ЭлементСтраница;	
	КонецЕсли;
	
	ПредыдущаяСтраницаСтрока = ПредыдущаяСтраница.Имя;
	УстановитьВидимостьКомандПанелиНавигации();
	
	Если Элементы.Страницы.ТекущаяСтраница = Элементы.ОтборОбъектыРемонта Тогда
		
		Гараж        = ПредопределенноеЗначение("Справочник.упГаражи.ПустаяСсылка");
		МестоРемонта = ПредопределенноеЗначение("Справочник.упМестаРемонта.ПустаяСсылка");
		СервиснаяОрганизация = ПредопределенноеЗначение("Справочник.упПартнеры.ПустаяСсылка");
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СписокОбъектов Тогда	
		
		УстановитьДоступностьЭлементовСпособаРемонта();
		
		ЗаполнитьСписокРемонтов();
				
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.Ремонты Тогда		
		
		Если ФормируютсяДокументыРемонт Тогда
			Элементы.ЗаявкиРемонты.ТекущаяСтраница = Элементы.ГруппаРемонты;
		Иначе	
			Элементы.ЗаявкиРемонты.ТекущаяСтраница = Элементы.ГруппаЗаявки;
		КонецЕсли;
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.ПечатьДокументов Тогда			
		СписокРемонтовДляПечати.Очистить();
		Если ПредыдущаяСтраница = Элементы.Ремонты Тогда
			мсвСтроки = СписокСозданныхРемонтов.НайтиСтроки(Новый Структура("Пометка",Истина));
			
			Для каждого Строка Из мсвСтроки Цикл
				НоваяСтрока = СписокРемонтовДляПечати.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				НоваяСтрока.Пометка = Истина;
			КонецЦикла;
			
		ИначеЕсли ПредыдущаяСтраница = Элементы.СписокОбъектов Тогда	
			мсвСтроки = СписокОбъектовРемонта.НайтиСтроки(Новый Структура("Пометка",Истина));
			
			Для каждого Строка Из мсвСтроки Цикл
				Если ЗначениеЗаполнено(Строка.ПоследнийРемонт) Тогда
					НоваяСтрока = СписокРемонтовДляПечати.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
					НоваяСтрока.РемонтИТОТС = Строка.ПоследнийРемонт;
					НоваяСтрока.Пометка = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьКомпоновщикНастроек(Настройки)
	
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Если НЕ ЗначениеЗаполнено(Настройки) Тогда
		СхемаКомпоновкиДанных = Обработки.упРМУправлениеРемонтами.ПолучитьМакет("ОбъектыРемонта");
		Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	КонецЕсли;
		
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КомпоновщикНастроек.Восстановить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокРемонтов()
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	// Компоновка макета
	КомпоновщикМакетаКомпоновкиДанных = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "Гараж", Гараж, ЗначениеЗаполнено(Гараж));	
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "ТекущаяДата" , ТекущаяДата, Истина);
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "ДатаНачальныхОстатков" , ДатаНачальныхОстатков, Истина);
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "СрокОтсчета" , СрокОтсчета, Истина);
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "СрокПредупрежденияОТОПробег" , СрокПредупрежденияОТОПробег, Истина);
	упСервисныеФункции.УстановитьПараметрСКД(Настройки, "СрокПредупрежденияОТОМоточасы" , СрокПредупрежденияОТОМоточасы, Истина);
	
	МакетКомпоновкиДанных = КомпоновщикМакетаКомпоновкиДанных.Выполнить(СхемаКомпоновкиДанных, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	// Инициализация процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	СписокОбъектовРемонта.Очистить();
	Результат = Новый ТаблицаЗначений;
	
	// Получение результата
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.УстановитьОбъект(Результат);
	ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений.Вывести(ПроцессорКомпоновкиДанных);
	
	Для каждого Строка Из Результат Цикл
		НоваяСтрока = СписокОбъектовРемонта.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		НоваяСтрока.НачалоРемонтаПлан = ?(ЗначениеЗаполнено(Строка.ДатаСледующегоТО),Строка.ДатаСледующегоТО,Строка.ПрогнозируемаяДатаСледующегоТО);
		Если Истина
			И ЗначениеЗаполнено(НоваяСтрока.НачалоРемонтаПлан)
			И ЗначениеЗаполнено(НоваяСтрока.ВидРемонта)
			И Строка.ВремяРаботПлан > 0
		Тогда
			НоваяСтрока.ОкончаниеРемонтаПлан = НоваяСтрока.НачалоРемонтаПлан + Строка.ВремяРаботПлан * 60 * 60;	
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СформироватьЗаявкиНаРемонтНаСервере()
	
	СписокСозданныхЗаявокНаРемонт.Очистить();
	
	мсвВыделенныеСтроки = СписокОбъектовРемонта.НайтиСтроки(Новый Структура("Пометка",Истина));
	мсвОбъектыРемонта   =  Новый Массив;
	
	Для каждого Строка Из мсвВыделенныеСтроки Цикл
		
		сткОбъектРемонта = Новый Структура();
		сткОбъектРемонта.Вставить("ОбъектРемонта",        Строка.ОбъектРемонта);
		сткОбъектРемонта.Вставить("ВидРемонта",           Строка.ВидРемонта);
		сткОбъектРемонта.Вставить("НачалоРемонтаПлан",    Строка.НачалоРемонтаПлан);
		сткОбъектРемонта.Вставить("ОкончаниеРемонтаПлан", Строка.ОкончаниеРемонтаПлан);
		мсвОбъектыРемонта.Добавить(сткОбъектРемонта); 
		
	КонецЦикла;
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("МестоРемонта",  МестоРемонта);
	Реквизиты.Вставить("Гараж",         Гараж);
	Реквизиты.Вставить("СервиснаяОрганизация", СервиснаяОрганизация);
	Реквизиты.Вставить("МестоРемонта",  МестоРемонта);
	Реквизиты.Вставить("СпособРемонта", СпособРемонта);	
	Реквизиты.Вставить("Документ",      Документы.упЗаявкаНаРемонтИТОТС.ПустаяСсылка());
	Отказ = Ложь;
	мсвЗаявки = упРемонтИТОТС.СформироватьДокументыНаРемонтИТОТС(мсвОбъектыРемонта, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		Для каждого ЗаявкаНаРемонтИТОТС Из мсвЗаявки Цикл

			НоваяСтрока = СписокСозданныхЗаявокНаРемонт.Добавить();
			НоваяСтрока.ОбъектРемонта             = ЗаявкаНаРемонтИТОТС.ОбъектРемонта;
			НоваяСтрока.ЗаявкаНаРемонтИТОТС       = ЗаявкаНаРемонтИТОТС.ДокументСсылка;
			СтатусНовая = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Новая;
			НоваяСтрока.СтатусРемонтаИТОТС        = СтатусНовая;
			НоваяСтрока.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Индекс(СтатусНовая);
			НоваяСтрока.Пометка = Ложь;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРемонтыНаСервере()
	
	СписокСозданныхРемонтов.Очистить();
	
	мсвВыделенныеСтроки = СписокОбъектовРемонта.НайтиСтроки(Новый Структура("Пометка",Истина));
	мсвОбъектыРемонта   =  Новый Массив;
	
	Для каждого Строка Из мсвВыделенныеСтроки Цикл
		
		сткОбъектРемонта = Новый Структура();
		сткОбъектРемонта.Вставить("ОбъектРемонта",        Строка.ОбъектРемонта);
		сткОбъектРемонта.Вставить("ВидРемонта",           Строка.ВидРемонта);
		сткОбъектРемонта.Вставить("НачалоРемонтаПлан",    Строка.НачалоРемонтаПлан);
		сткОбъектРемонта.Вставить("ОкончаниеРемонтаПлан", Строка.ОкончаниеРемонтаПлан);
		
		мсвОбъектыРемонта.Добавить(сткОбъектРемонта); 
		
	КонецЦикла;
	
	Реквизиты = Новый Структура();
	Реквизиты.Вставить("МестоРемонта",  МестоРемонта);
	Реквизиты.Вставить("Гараж",         Гараж);
	Реквизиты.Вставить("СервиснаяОрганизация", СервиснаяОрганизация);
	Реквизиты.Вставить("СпособРемонта", СпособРемонта);
	Реквизиты.Вставить("Документ",      Документы.упРемонтИТОТС.ПустаяСсылка());
	Отказ = Ложь;
	мсвЗаявки = упРемонтИТОТС.СформироватьДокументыНаРемонтИТОТС(мсвОбъектыРемонта, Реквизиты, Отказ);
	
	Если НЕ Отказ Тогда
		Для каждого РемонтИТОТС Из мсвЗаявки Цикл

			НоваяСтрока = СписокСозданныхРемонтов.Добавить();
			НоваяСтрока.ОбъектРемонта = РемонтИТОТС.ОбъектРемонта;
			НоваяСтрока.РемонтИТОТС   = РемонтИТОТС.ДокументСсылка;
			СтатусНовый = Перечисления.упСтатусыРемонтаИТОТС.Новый;
			НоваяСтрока.СтатусРемонтаИТОТС        = СтатусНовый;
			НоваяСтрока.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыРемонтаИТОТС.Индекс(СтатусНовый);
			НоваяСтрока.Пометка = Ложь;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеревестиЗаявкиКВыполнению(Команда)
	ПеревестиЗаявкиКВыполнениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеревестиЗаявкиКВыполнениюНаСервере()
	
	мсвСтрокиСписка = СписокСозданныхЗаявокНаРемонт.НайтиСтроки(Новый Структура("Пометка",Истина));
	Для каждого Строка Из мсвСтрокиСписка Цикл
		ОписаниеОшибки = "";
		Отказ = Ложь;
		
		Если Строка.СтатусРемонтаИТОТС = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Отменена Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось перевести к выполнению %1. Ошибка: %2'");
			ОписаниеОшибки = Нстр("ru = 'Нельзя переводить к выполнению отмененную заявку.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.ЗаявкаНаРемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Продолжить;
		КонецЕсли;
		
		СтатусКВыполнению = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.КВыполнению;
		упРемонтИТОТС.УстановитьСтатусДокументаРемонта(Строка.ЗаявкаНаРемонтИТОТС, СтатусКВыполнению, ОписаниеОшибки, Отказ);
		Если Отказ Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось перевести к выполнению %1. Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.ЗаявкаНаРемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе	
			Строка.СтатусРемонтаИТОТС        = СтатусКВыполнению;
			Строка.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Индекс(СтатусКВыполнению);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗапланироватьРемонтыНаСервере()
	
	мсвСтрокиСписка = СписокСозданныхРемонтов.НайтиСтроки(Новый Структура("Пометка",Истина));
	Для каждого Строка Из мсвСтрокиСписка Цикл
		ОписаниеОшибки = "";
		Отказ = Ложь;
		
		Если Строка.СтатусРемонтаИТОТС = Перечисления.упСтатусыРемонтаИТОТС.Отменен Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось перевести в запланирован %1. Ошибка: %2'");
			ОписаниеОшибки = Нстр("ru = 'Нельзя планировать отмененный ремонт.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.РемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Продолжить;
		КонецЕсли;
		
		СтатусЗапланирован = Перечисления.упСтатусыРемонтаИТОТС.Запланирован;
		упРемонтИТОТС.УстановитьСтатусДокументаРемонта(Строка.РемонтИТОТС, СтатусЗапланирован, ОписаниеОшибки, Отказ);
		Если Отказ Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось запланировать %1. Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.РемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе	
			Строка.СтатусРемонтаИТОТС        = СтатусЗапланирован;
			Строка.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыРемонтаИТОТС.Индекс(СтатусЗапланирован);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗапланироватьРемонты(Команда)
	ЗапланироватьРемонтыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьЗаявкиНаСервере()
	
	мсвСтрокиСписка = СписокСозданныхЗаявокНаРемонт.НайтиСтроки(Новый Структура("Пометка",Истина));
	Для каждого Строка Из мсвСтрокиСписка Цикл
		ОписаниеОшибки = "";
		Отказ = Ложь;
		СтатусОтменен = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Отменена;
		упРемонтИТОТС.УстановитьСтатусДокументаРемонта(Строка.ЗаявкаНаРемонтИТОТС, СтатусОтменен, ОписаниеОшибки, Отказ);
		Если Отказ Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось отменить %1. Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.ЗаявкаНаРемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе	
			Строка.СтатусРемонтаИТОТС        = СтатусОтменен;
			Строка.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыЗаявкиНаРемонтИТОТС.Индекс(СтатусОтменен);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОтменитьРемонтыНаСервере()
	
	мсвСтрокиСписка = СписокСозданныхРемонтов.НайтиСтроки(Новый Структура("Пометка",Истина));
	Для каждого Строка Из мсвСтрокиСписка Цикл
		ОписаниеОшибки = "";
		Отказ = Ложь;
		СтатусОтменен = Перечисления.упСтатусыРемонтаИТОТС.Отменен;
		упРемонтИТОТС.УстановитьСтатусДокументаРемонта(Строка.РемонтИТОТС, СтатусОтменен, ОписаниеОшибки, Отказ);
		Если Отказ Тогда
			ТекстСообщения = Нстр("ru = 'Не удалось отменить %1. Ошибка: %2'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка.РемонтИТОТС, ОписаниеОшибки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		Иначе	
			Строка.СтатусРемонтаИТОТС        = СтатусОтменен;
			Строка.ПорядокСтатусРемонтаИТОТС = Перечисления.упСтатусыРемонтаИТОТС.Индекс(СтатусОтменен);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОтменитьЗаявки(Команда)
	ОтменитьЗаявкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРемонты(Команда)
	ОтменитьРемонтыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МестоРемонтаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Гараж) Тогда
		СтандартнаяОбработка = Ложь;
		сткОтбор = Новый Структура("Владелец", Гараж);
		сткПараметры = Новый Структура("Отбор", сткОтбор);
		ОткрытьФорму("Справочник.упМестаРемонта.ФормаВыбора", сткПараметры, Элемент, УникальныйИдентификатор);
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура СпособРемонтаПриИзменении(Элемент)
	УстановитьДоступностьЭлементовСпособаРемонта();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовСпособаРемонта()
	Если СпособРемонта = ПредопределенноеЗначение("Перечисление.упСпособыРемонтов.СобственнымиСилами") Тогда
		СервиснаяОрганизация = ПредопределенноеЗначение("Справочник.упПартнеры.ПустаяСсылка");
		Элементы.СтраницыСпособыРемонта.ТекущаяСтраница = Элементы.ГруппаСобственнымиСилами;
	Иначе
		Гараж                = ПредопределенноеЗначение("Справочник.упГаражи.ПустаяСсылка");
		МестоРемонта         = ПредопределенноеЗначение("Справочник.упМестаРемонта.ПустаяСсылка");
		Элементы.СтраницыСпособыРемонта.ТекущаяСтраница = Элементы.ГруппаСервиснаяОрганизация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
